/* REXX */
INFILE  = "'Z81701.SOURCE(ROCKS1)'"
OUTFILE = "'Z81701.OUTPUT(REXXOUT)'"
ADDRESS TSO "ALLOC FI(INPUT) DA("INFILE") SHR REUSE"
ADDRESS TSO "EXECIO * DISKR INPUT (STEM INDATA. FINIS"

IF RC <> 0 THEN DO
    SAY 'FEHLER beim Lesen von 'INFILE
    RETURN
END

DO I = 1 TO INDATA.0
    OUTDATA.I = INDATA.I
END

OUTDATA.0 = INDATA.0

ADDRESS TSO "ALLOC FI(OUTPUT) DA("OUTFILE") OLD REUSE"
ADDRESS TSO "EXECIO" OUTDATA.0 "DISKW OUTPUT (STEM OUTDATA. FINIS"


ADDRESS TSO "FREE FI(INPUT OUTPUT)"