       IDENTIFICATION DIVISION.
       PROGRAM-ID. FORLOOP.

       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01 YEAR-COUNTER    PIC 9(2) VALUE 0.
       01 INVESTMENT      PIC 9(4) VALUE 1000.

       PROCEDURE DIVISION.
           PERFORM WITH TEST AFTER
               VARYING YEAR-COUNTER FROM 1 BY 1
               UNTIL YEAR-COUNTER >= 5
                  COMPUTE INVESTMENT = INVESTMENT * 1.10
           END-PERFORM.
           DISPLAY INVESTMENT.