       IDENTIFICATION DIVISION.
       PROGRAM-ID. GET-NUMBER.

       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01 INPUT-NUMBER    PIC 9(2).
       01 OUTPUT-NUMBER   PIC 9(3).

       PROCEDURE DIVISION.
       100-GET-NUMBER.
           DISPLAY "Enter a number: "
           ACCEPT INPUT-NUMBER.
           ADD 250 300 -35 TO INPUT-NUMBER GIVING OUTPUT-NUMBER 
           IF OUTPUT-NUMBER > 0 THEN
              PERFORM 200-PRINT-NUMBER
           END-IF.
           PERFORM 300-END-PROGRAM.

       200-PRINT-NUMBER.
           DISPLAY INPUT-NUMBER.
           DISPLAY OUTPUT-NUMBER.

       300-END-PROGRAM.
           GOBACK.
