       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL-MATH.

       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01 CURRENT-YEAR    PIC 9(4) VALUE 2021.
       01 YEAR-COUNTER    PIC 9(4) VALUE 1.
       01 CURRENT-VALUE   PIC 9(4) VALUE 0.
       01 INVESTMENT      PIC 9(4) VALUE 1000.
       01 SALES-AMOUNT    PIC 9(3) VALUE 500.
       01 TAX-AMOUNT      PIC 9(3) VALUE 0.
       01 ANNUAL-RATE     PIC 9(3)V99 VALUE 10.50.
       01 CHANGE-AMOUNT   PIC 9(3) VALUE 20.
       01 LAST-YEAR-SALES PIC 9(3) VALUE 100.
       01 CHANGE-PERCENT  PIC 9(3)V99 VALUE 0.
       01 QUOTIENT        PIC 9(3) VALUE 0.
       01 REM-VALUE       PIC 9(3) VALUE 0.


       PROCEDURE DIVISION.

           ADD YEAR-COUNTER TO CURRENT-YEAR.
           SUBTRACT YEAR-COUNTER FROM CURRENT-YEAR.
           ADD 5000 2000 TO INVESTMENT GIVING CURRENT-VALUE.
      *     SUBTRACT 1000 700 FROM INVESTMENT GIVING CURRENT-VALUE.
           MULTIPLY 0.05 BY SALES-AMOUNT GIVING TAX-AMOUNT.
      *     DIVIDE 100 INTO ANNUAL-RATE.
      *    RESULT 000.10
           DIVIDE 100 INTO ANNUAL-RATE ROUNDED.
      *    RESULT 000.11

           DIVIDE CHANGE-AMOUNT BY LAST-YEAR-SALES GIVING CHANGE-PERCENT 
           DIVIDE 100 BY 12 GIVING QUOTIENT REMAINDER REM-VALUE 

           DISPLAY CURRENT-YEAR.
           DISPLAY CURRENT-VALUE.
           DISPLAY TAX-AMOUNT.
           DISPLAY ANNUAL-RATE.
           DISPLAY CHANGE-PERCENT.
           DISPLAY QUOTIENT.
           DISPLAY REM-VALUE.
           STOP RUN.