//RUNBASH  JOB (ACCT),'RUN BASH SCRIPT',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=BPXBATCH
//STDOUT   DD SYSOUT=*
//STDERR   DD SYSOUT=*
//STDPARM  DD *
SH /u/user/path/to/file
/*